      * TABLA CTACTES - MAESTRO DE CUENTAS CORRIENTES Y DEPOSITOS
        01  REG-INVM.
            05 INVM-ID-CLIENTE      PIC 9(08).
            05 INVM-COD-ULT-MOV     PIC 9(02).
            05 INVM-FECHA-ULT-MOV   PIC X(10).
            05 INVM-IMPORTE-MOV     PIC S9(10)V99.
            05 INVM-SALDO-ACTUAL    PIC S9(10)V99.
