       IDENTIFICATION DIVISION.
       PROGRAM-ID. DBIOTRAN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           EXEC SQL INCLUDE SQLCA END-EXEC.
       LINKAGE SECTION.
           01 LK-ACCION-TRANS PIC X(01). *> 'C'=Commit, 'R'=Rollback
       PROCEDURE DIVISION USING LK-ACCION-TRANS.
       0000-PRINCIPAL.
           EVALUATE LK-ACCION-TRANS
               WHEN 'C'
                   EXEC SQL COMMIT WORK END-EXEC
               WHEN 'R'
                   EXEC SQL ROLLBACK WORK END-EXEC
           END-EVALUATE.
           GOBACK.
