       IDENTIFICATION DIVISION.
       PROGRAM-ID. RRD000.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           EXEC SQL INCLUDE SQLCA END-EXEC.
           EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01  WS-HOST-VARS.
           05 WS-ID-REG-SQL        PIC 9(09).
           05 WS-DATOS-TX-SQL      PIC X(500).
           05 WS-ESTADO-SQL        PIC 9(01).
           05 WS-ID-LOTE-SQL       PIC 9(09).
           05 WS-RETORNO-CORE      PIC 9(02).
           05 WS-REPLICA-SQL       PIC X(04).
           EXEC SQL END DECLARE SECTION END-EXEC.
       01  WS-CONT-LOTE            PIC 9(09) VALUE 0.
       01  WS-EOF-CURSOR           PIC X(01) VALUE 'N'.
       LINKAGE SECTION.
           COPY LKCIF.
       01  WS-TFFM-VARS.
           05 WS-ID-LOTE           PIC 9(09).
           05 WS-FILE-NAME         PIC X(120).
           05 WS-FASE              PIC X(02).
           05 WS-TYPE-UPDATE       PIC X(10).
           05 WS-REPLICA-ASIG      PIC X(04).
           05 WS-RETRY-COUNT       PIC 9(02).
       PROCEDURE DIVISION USING WS-TFFM-VARS,
                                LK-DATOS-TRANSACCION.
       000-PRINCIPAL.
           MOVE WS-ID-LOTE TO WS-ID-LOTE-SQL.
           MOVE WS-REPLICA-ASIG TO WS-REPLICA-SQL.
           PERFORM 100-ABRIR.
           PERFORM 200-FETCH.
           PERFORM UNTIL WS-EOF-CURSOR = 'Y'
               PERFORM 300-PROC
               PERFORM 200-FETCH
           END-PERFORM.
           PERFORM 400-CERRAR.
           EXEC SQL COMMIT END-EXEC.
           MOVE 0 TO LK-COD-RETORNO.
           GOBACK.
       100-ABRIR.
           IF WS-REPLICA-ASIG = "TF01" PERFORM 101-O.
           IF WS-REPLICA-ASIG = "TF02" PERFORM 102-O.
           IF WS-REPLICA-ASIG = "TF03" PERFORM 103-O.
           IF WS-REPLICA-ASIG = "TF04" PERFORM 104-O.
           IF WS-REPLICA-ASIG = "TF05" PERFORM 105-O.
           IF WS-REPLICA-ASIG = "TF06" PERFORM 106-O.
       101-O.
           EXEC SQL DECLARE C1 CURSOR FOR SELECT ID_REGISTRO,
           DATOS_TX FROM TF01 WHERE ID_LOTE = :WS-ID-LOTE-SQL
           AND ESTADO = 2 END-EXEC EXEC SQL OPEN C1 END-EXEC.
       102-O.
           EXEC SQL DECLARE C2 CURSOR FOR SELECT ID_REGISTRO,
           DATOS_TX FROM TF02 WHERE ID_LOTE = :WS-ID-LOTE-SQL
           AND ESTADO = 2 END-EXEC EXEC SQL OPEN C2 END-EXEC.
       103-O.
           EXEC SQL DECLARE C3 CURSOR FOR SELECT ID_REGISTRO,
           DATOS_TX FROM TF03 WHERE ID_LOTE = :WS-ID-LOTE-SQL
           AND ESTADO = 2 END-EXEC EXEC SQL OPEN C3 END-EXEC.
       104-O.
           EXEC SQL DECLARE C4 CURSOR FOR SELECT ID_REGISTRO,
           DATOS_TX FROM TF04 WHERE ID_LOTE = :WS-ID-LOTE-SQL
           AND ESTADO = 2 END-EXEC EXEC SQL OPEN C4 END-EXEC.
       105-O.
           EXEC SQL DECLARE C5 CURSOR FOR SELECT ID_REGISTRO,
           DATOS_TX FROM TF05 WHERE ID_LOTE = :WS-ID-LOTE-SQL
           AND ESTADO = 2 END-EXEC EXEC SQL OPEN C5 END-EXEC.
       106-O.
           EXEC SQL DECLARE C6 CURSOR FOR SELECT ID_REGISTRO,
           DATOS_TX FROM TF06 WHERE ID_LOTE = :WS-ID-LOTE-SQL
           AND ESTADO = 2 END-EXEC EXEC SQL OPEN C6 END-EXEC.
       200-FETCH.
           IF WS-REPLICA-ASIG = "TF01"
           EXEC SQL FETCH C1 INTO :WS-ID-REG-SQL, :WS-DATOS-TX-SQL 
           END-EXEC.
           IF WS-REPLICA-ASIG = "TF02"
           EXEC SQL FETCH C2 INTO :WS-ID-REG-SQL, :WS-DATOS-TX-SQL 
           END-EXEC.
           IF WS-REPLICA-ASIG = "TF03"
           EXEC SQL FETCH C3 INTO :WS-ID-REG-SQL, :WS-DATOS-TX-SQL 
           END-EXEC.
           IF WS-REPLICA-ASIG = "TF04"
           EXEC SQL FETCH C4 INTO :WS-ID-REG-SQL, :WS-DATOS-TX-SQL 
           END-EXEC.
           IF WS-REPLICA-ASIG = "TF05"
           EXEC SQL FETCH C5 INTO :WS-ID-REG-SQL, :WS-DATOS-TX-SQL
            END-EXEC.
           IF WS-REPLICA-ASIG = "TF06"
           EXEC SQL FETCH C6 INTO :WS-ID-REG-SQL, :WS-DATOS-TX-SQL 
           END-EXEC.
           IF SQLCODE = 100 OR SQLCODE < 0 MOVE 'Y' TO WS-EOF-CURSOR.
       300-PROC.
           PERFORM 310-UP.
           INITIALIZE LK-DATOS-TRANSACCION.
           CALL "IN0000" USING WS-DATOS-TX-SQL, LK-DATOS-TRANSACCION.
           MOVE LK-COD-RETORNO TO WS-RETORNO-CORE.
           IF LK-COD-RETORNO = 0 MOVE 4 TO WS-ESTADO-SQL
           ELSE MOVE 7 TO WS-ESTADO-SQL END-IF.
           PERFORM 320-FIN.
           ADD 1 TO WS-CONT-LOTE.
       310-UP.
           IF WS-REPLICA-ASIG = "TF01"
           EXEC SQL UPDATE TF01 SET ESTADO = 3
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF02"
           EXEC SQL UPDATE TF02 SET ESTADO = 3
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF03"
           EXEC SQL UPDATE TF03 SET ESTADO = 3
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF04"
           EXEC SQL UPDATE TF04 SET ESTADO = 3
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF05"
           EXEC SQL UPDATE TF05 SET ESTADO = 3
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF06"
           EXEC SQL UPDATE TF06 SET ESTADO = 3
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
       320-FIN.
           IF WS-REPLICA-ASIG = "TF01"
           EXEC SQL UPDATE TF01 SET ESTADO = :WS-ESTADO-SQL,
           COD_ERROR = :WS-RETORNO-CORE
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF02"
           EXEC SQL UPDATE TF02 SET ESTADO = :WS-ESTADO-SQL,
           COD_ERROR = :WS-RETORNO-CORE
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF03"
           EXEC SQL UPDATE TF03 SET ESTADO = :WS-ESTADO-SQL,
           COD_ERROR = :WS-RETORNO-CORE
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF04"
           EXEC SQL UPDATE TF04 SET ESTADO = :WS-ESTADO-SQL,
           COD_ERROR = :WS-RETORNO-CORE
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF05"
           EXEC SQL UPDATE TF05 SET ESTADO = :WS-ESTADO-SQL,
           COD_ERROR = :WS-RETORNO-CORE
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
           IF WS-REPLICA-ASIG = "TF06"
           EXEC SQL UPDATE TF06 SET ESTADO = :WS-ESTADO-SQL,
           COD_ERROR = :WS-RETORNO-CORE
           WHERE ID_REGISTRO = :WS-ID-REG-SQL END-EXEC.
       400-CERRAR.
           IF WS-REPLICA-ASIG = "TF01" EXEC SQL CLOSE C1 END-EXEC.
           IF WS-REPLICA-ASIG = "TF02" EXEC SQL CLOSE C2 END-EXEC.
           IF WS-REPLICA-ASIG = "TF03" EXEC SQL CLOSE C3 END-EXEC.
           IF WS-REPLICA-ASIG = "TF04" EXEC SQL CLOSE C4 END-EXEC.
           IF WS-REPLICA-ASIG = "TF05" EXEC SQL CLOSE C5 END-EXEC.
           IF WS-REPLICA-ASIG = "TF06" EXEC SQL CLOSE C6 END-EXEC.