       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTCONN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           EXEC SQL INCLUDE SQLCA END-EXEC.
           EXEC SQL BEGIN DECLARE SECTION END-EXEC.
           01 DB-STR PIC X(50).
           EXEC SQL END DECLARE SECTION END-EXEC.
       PROCEDURE DIVISION.
           MOVE 'DSN=cobol;UID=root;PWD=tata;' TO DB-STR.
           INSPECT DB-STR REPLACING TRAILING SPACES BY LOW-VALUES.
           EXEC SQL CONNECT TO :DB-STR END-EXEC.
           IF SQLCODE = 0
               DISPLAY "SUCCESS"
           ELSE
               DISPLAY "FAILED: " SQLCODE
           END-IF.
           EXEC SQL DISCONNECT CURRENT END-EXEC.
           STOP RUN.
